### Types of operators

In [1]:
%load_ext sql
%sql postgresql://admin:admin@db:5432/company

Connecting to 'postgresql://admin:***@db:5432/company'

Here is a list of the types of operators in SQL:

- Arithmetic Operators
- Comparison Operators
- Logical Operators
- Between, Like and In Operators
- Set Operators
- String Operators
- Other Operators

#### Arithmetic Operators

| Operator | Description         | Example        | Result |
|----------|---------------------|----------------|--------|
| +        | Addition            | SELECT 10 + 5; | 15     |
| -        | Subtraction         | SELECT 10 - 5; | 5      |
| *        | Multiplication      | SELECT 10 * 5; | 50     |
| /        | Division            | SELECT 10 / 5; | 2      |
| %        | Modulus (remainder) | SELECT 10 % 3; | 1      |

1. Retrieve the first_name, salary and calculate a 10% bonus on the salary.


```sql
SELECT first_name, salary, (salary * .10) AS bonus 
FROM ex_employee;    
```

In [2]:
%%sql
SELECT * FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [3]:
%%sql
SELECT first_name, salary, (salary * .10) as bonus 
FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+------------+----------+-----------+
| first_name |  salary  |   bonus   |
+------------+----------+-----------+
|  Vanessa   | 69330.56 | 6933.0560 |
|   Penny    | 96482.00 | 9648.2000 |
|  Matthew   | 97416.22 | 9741.6220 |
|   Joshua   | 65313.80 | 6531.3800 |
| Christina  | 58827.32 | 5882.7320 |
|  Jonathon  | 57427.31 | 5742.7310 |
|  Clinton   | 45352.74 | 4535.2740 |
|  Veronica  | 78772.56 | 7877.2560 |
|   Louis    | 30448.72 | 3044.8720 |
|  Sabrina   | 88476.72 | 8847.6720 |
+------------+----------+-----------+
Truncated to displaylimit of 10.

1. Calculate the Annual Salary and Salary Increment by 5% - show the monthly new salary as well


```sql
SELECT first_name, last_name, salary, 
    (salary * 12) AS annual_salary,
    (salary * .05) AS increment_amount,
    (salary * 1.05 AS new_salary,
    (salary + salary * .05) AS new_salary2
FROM ex_employees;    
```

In [4]:
%%sql

SELECT first_name, last_name, salary,
        (salary * 12) AS annual_salary,
        (salary * .05) AS increment_amount,
        (salary + salary * .05) AS new_salary,
        (salary * 1.05) AS new_salary2
FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+------------+-----------+----------+---------------+------------------+-------------+-------------+
| first_name | last_name |  salary  | annual_salary | increment_amount |  new_salary | new_salary2 |
+------------+-----------+----------+---------------+------------------+-------------+-------------+
|  Vanessa   |  Jackson  | 69330.56 |   831966.72   |    3466.5280     |  72797.0880 |  72797.0880 |
|   Penny    |   Ingram  | 96482.00 |   1157784.00  |    4824.1000     | 101306.1000 | 101306.1000 |
|  Matthew   |  Mcdonald | 97416.22 |   1168994.64  |    4870.8110     | 102287.0310 | 102287.0310 |
|   Joshua   |   Ramos   | 65313.80 |   783765.60   |    3265.6900     |  68579.4900 |  68579.4900 |
| Christina  |   Clark   | 58827.32 |   705927.84   |    2941.3660     |  61768.6860 |  61768.6860 |
|  Jonathon  |  Sullivan | 57427.31 |   689127.72   |    2871.3655     |  60298.6755 |  60298.6755 |
|  Clinton   |  Aguirre  | 45352.74 |   544232.88   |    2267.6370     |  47620.3770 |  47620.3770 |
|  Veronica  |   Weber   | 78772.56 |   945270.72   |    3938.6280     |  82711.1880 |  82711.1880 |
|   Louis    |   Rivera  | 30448.72 |   365384.64   |    1522.4360     |  31971.1560 |  31971.1560 |
|  Sabrina   |  Gonzalez | 88476.72 |   1061720.64  |    4423.8360     |  92900.5560 |  92900.5560 |
+------------+-----------+----------+---------------+------------------+-------------+-------------+
Truncated to displaylimit of 10.

#### Comparison Operators

| Operator | Description           |
|----------|-----------------------|
| =        | Equal to              |
| != or <> | Not equal to          |
| >        | Greater than          |
| <        | Less than             |
| >=       | Greater than or equal |
| <=       | Less than or equal    |

In [5]:
%%sql
SELECT * FROM ex_employee
WHERE age=30;

Running query in 'postgresql://admin:***@db:5432/company'

12 rows affected.

+-------------+------------+-----------+-------------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |             email             | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------------+------------+----------+--------------+-----+
|      60     |   Rickey   |   Moore   |  rjohnson@russell-morgan.com  | Operations | 77195.29 |  2022-12-30  |  30 |
|     115     | Stephanie  |   Brooks  |     deborahperez@yahoo.com    |     HR     | 75502.10 |  2023-10-04  |  30 |
|     165     |   Terry    |  Stewart  |  mooreraymond@rios-henry.org  | Operations | 87390.22 |  2020-05-19  |  30 |
|     168     |   Angela   |   Morris  |    tyleribarra@hotmail.com    |     IT     | 40796.29 |  2020-11-23  |  30 |
|     302     |  Michael   | Hernandez |       amanda32@yahoo.com      |     IT     | 37367.21 |  2022-11-20  |  30 |
|     368     |  Jennifer  |   Wilson  | salinastodd@bowers-daniel.net | Operations | 74424.26 |  2023-11-01  |  30 |
|     618     |  Michael   |   Davis   |     alicesherman@yahoo.com    | Operations | 47246.41 |  2021-02-27  |  30 |
|     779     |  Kimberly  |   Myers   |    oburnett@kim-romero.com    | Operations | 57472.60 |  2020-02-11  |  30 |
|     877     |   Bobby    |   Wright  |      wrightmaria@rich.com     |     HR     | 38653.22 |  2022-02-11  |  30 |
|     893     |   Diane    |  Collins  |  stevenallen@weaver-haley.net | Operations | 62058.90 |  2020-06-05  |  30 |
+-------------+------------+-----------+-------------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [6]:
%%sql
SELECT * FROM ex_employee
WHERE age!=30;

-- SELECT * FROM ex_employee
-- WHERE age<>30;

Running query in 'postgresql://admin:***@db:5432/company'

988 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [7]:
%%sql
SELECT * FROM ex_employee
WHERE salary > 50000;

Running query in 'postgresql://admin:***@db:5432/company'

726 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
|      9      |  Caroline  |  Kennedy  |    inguyen@huynh.com    |  Finance   | 88878.64 |  2024-07-17  |  47 |
|      10     |    Adam    |  Sanchez  |  luisclark@hotmail.com  |     HR     | 88331.24 |  2020-03-23  |  38 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [8]:
%%sql
SELECT * FROM ex_employee
WHERE salary >= 50000;

Running query in 'postgresql://admin:***@db:5432/company'

726 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
|      9      |  Caroline  |  Kennedy  |    inguyen@huynh.com    |  Finance   | 88878.64 |  2024-07-17  |  47 |
|      10     |    Adam    |  Sanchez  |  luisclark@hotmail.com  |     HR     | 88331.24 |  2020-03-23  |  38 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [9]:
%%sql
SELECT * FROM ex_employee
WHERE salary < 50000;

Running query in 'postgresql://admin:***@db:5432/company'

274 rows affected.

+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |              email               | department |  salary  | joining_date | age |
+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
|      4      |  Clinton   |  Aguirre  |      jamieortega@yahoo.com       |     HR     | 45352.74 |  2021-04-04  |  55 |
|      6      |   Louis    |   Rivera  |        parksamy@gmail.com        |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      8      |  Jillian   |   Lewis   |     sreese@mclean-baker.net      | Marketing  | 49895.55 |  2021-06-08  |  33 |
|      15     |   Tammy    |  Collins  |      cherylbanks@gmail.com       |     HR     | 39382.83 |  2021-03-12  |  52 |
|      16     |  Miranda   |  Mcmahon  |     bonillamatthew@yahoo.com     | Operations | 41564.15 |  2021-04-20  |  37 |
|      17     |   Carla    |   Melton  | nicholas84@johnson-phillips.com  |  Finance   | 41986.90 |  2024-11-08  |  28 |
|      23     |   David    |  Webster  |   zacharylee@thomas-sharp.com    | Marketing  | 35390.49 |  2022-06-21  |  54 |
|      32     |   Nancy    |   Ortiz   | claytonmcguire@turner-fowler.com |     HR     | 37425.94 |  2023-04-18  |  35 |
|      34     |   Robert   |    Duke   |        unguyen@yahoo.com         | Marketing  | 49302.91 |  2020-02-04  |  48 |
|      42     |   James    |   Vaughn  |      jessicaperez@hall.com       |     HR     | 47270.87 |  2023-11-18  |  51 |
+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [10]:
%%sql
SELECT * FROM ex_employee
WHERE salary <= 50000;

Running query in 'postgresql://admin:***@db:5432/company'

274 rows affected.

+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |              email               | department |  salary  | joining_date | age |
+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
|      4      |  Clinton   |  Aguirre  |      jamieortega@yahoo.com       |     HR     | 45352.74 |  2021-04-04  |  55 |
|      6      |   Louis    |   Rivera  |        parksamy@gmail.com        |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      8      |  Jillian   |   Lewis   |     sreese@mclean-baker.net      | Marketing  | 49895.55 |  2021-06-08  |  33 |
|      15     |   Tammy    |  Collins  |      cherylbanks@gmail.com       |     HR     | 39382.83 |  2021-03-12  |  52 |
|      16     |  Miranda   |  Mcmahon  |     bonillamatthew@yahoo.com     | Operations | 41564.15 |  2021-04-20  |  37 |
|      17     |   Carla    |   Melton  | nicholas84@johnson-phillips.com  |  Finance   | 41986.90 |  2024-11-08  |  28 |
|      23     |   David    |  Webster  |   zacharylee@thomas-sharp.com    | Marketing  | 35390.49 |  2022-06-21  |  54 |
|      32     |   Nancy    |   Ortiz   | claytonmcguire@turner-fowler.com |     HR     | 37425.94 |  2023-04-18  |  35 |
|      34     |   Robert   |    Duke   |        unguyen@yahoo.com         | Marketing  | 49302.91 |  2020-02-04  |  48 |
|      42     |   James    |   Vaughn  |      jessicaperez@hall.com       |     HR     | 47270.87 |  2023-11-18  |  51 |
+-------------+------------+-----------+----------------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

#### Logical Operators

| Operator | Description                         |
|----------|-------------------------------------|
| AND      | All conditions must be true         |
| OR       | At least one condition must be true |
| NOT      | Negates the condition               |

In [12]:
%%sql
SELECT * FROM ex_employee
WHERE age >= 40 AND salary >= 5000;

Running query in 'postgresql://admin:***@db:5432/company'

527 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |     lwebb@patel.com     |     IT     | 97416.22 |  2022-09-02  |  46 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      2      | Christina  |   Clark   |   littlekyle@yahoo.com  |     IT     | 58827.32 |  2021-10-02  |  46 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [15]:
%%sql
SELECT * FROM ex_employee
WHERE age > 60 or salary >= 90000;

Running query in 'postgresql://admin:***@db:5432/company'

139 rows affected.

+-------------+------------+-----------+----------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |           email            | department |  salary  | joining_date | age |
+-------------+------------+-----------+----------------------------+------------+----------+--------------+-----+
|     394     |   Penny    |   Ingram  |   salinassara@yahoo.com    |     HR     | 96482.00 |  2020-12-12  |  43 |
|     639     |  Matthew   |  Mcdonald |      lwebb@patel.com       |     IT     | 97416.22 |  2022-09-02  |  46 |
|      19     |  Jessica   |  Williams |     royrandy@kelly.com     | Operations | 98452.12 |  2020-07-02  |  28 |
|      26     |  Eduardo   |   Smith   |    rossjared@montes.com    |     IT     | 96756.21 |  2021-03-31  |  42 |
|      31     |  Kristina  |   Banks   | gutierrezjeffrey@gmail.com | Operations | 91453.39 |  2021-09-14  |  36 |
|      36     |  Douglas   |  Webster  |       wcarey@ray.biz       |  Finance   | 96160.89 |  2024-10-11  |  26 |
|      41     |  Kathleen  |   Bailey  |  zthompson@smith-wall.com  |  Finance   | 92873.35 |  2024-11-22  |  24 |
|      65     |   Donna    |   Gibbs   |  milleralicia@johnson.com  |     HR     | 98453.91 |  2024-09-26  |  23 |
|      67     |   Andrew   |   Evans   |    sfields@jimenez.org     | Operations | 97693.15 |  2021-07-27  |  35 |
|      72     |  Roberto   |   Frost   |  saraferguson@hotmail.com  |     HR     | 97048.59 |  2024-10-17  |  53 |
+-------------+------------+-----------+----------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

In [17]:
%%sql
SELECT * FROM ex_employee
WHERE NOT (department = 'IT');

Running query in 'postgresql://admin:***@db:5432/company'

794 rows affected.

+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
| employee_id | first_name | last_name |          email          | department |  salary  | joining_date | age |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
|     324     |  Vanessa   |  Jackson  |     qhood@yahoo.com     |     HR     | 69330.56 |  2022-05-09  |  59 |
|     394     |   Penny    |   Ingram  |  salinassara@yahoo.com  |     HR     | 96482.00 |  2020-12-12  |  43 |
|      1      |   Joshua   |   Ramos   |  alexandra29@gmail.com  | Operations | 65313.80 |  2024-05-23  |  42 |
|      3      |  Jonathon  |  Sullivan |  tannerivan@johnson.com | Operations | 57427.31 |  2020-04-30  |  50 |
|      4      |  Clinton   |  Aguirre  |  jamieortega@yahoo.com  |     HR     | 45352.74 |  2021-04-04  |  55 |
|      5      |  Veronica  |   Weber   | trevinosteven@ramos.com | Operations | 78772.56 |  2020-10-06  |  51 |
|      6      |   Louis    |   Rivera  |    parksamy@gmail.com   |  Finance   | 30448.72 |  2020-05-05  |  41 |
|      7      |  Sabrina   |  Gonzalez | rwillis@mason-clark.biz | Marketing  | 88476.72 |  2020-10-15  |  48 |
|      8      |  Jillian   |   Lewis   | sreese@mclean-baker.net | Marketing  | 49895.55 |  2021-06-08  |  33 |
|      9      |  Caroline  |  Kennedy  |    inguyen@huynh.com    |  Finance   | 88878.64 |  2024-07-17  |  47 |
+-------------+------------+-----------+-------------------------+------------+----------+--------------+-----+
Truncated to displaylimit of 10.

#### Between, Like and In Operators

1. Retrieve employees whose salary is between 40,000 and 60,000. - Use BETWEEN Operators

In [22]:
%%sql
SELECT first_name, last_name, salary FROM ex_employee
WHERE salary BETWEEN 40000 AND 60000;

-- SELECT first_name, last_name, salary FROM ex_employee
-- WHERE salary >= 40000 AND salary <= 60000;

Running query in 'postgresql://admin:***@db:5432/company'

281 rows affected.

+------------+-----------+----------+
| first_name | last_name |  salary  |
+------------+-----------+----------+
| Christina  |   Clark   | 58827.32 |
|  Jonathon  |  Sullivan | 57427.31 |
|  Clinton   |  Aguirre  | 45352.74 |
|  Jillian   |   Lewis   | 49895.55 |
|   Victor   |    Lamb   | 55038.09 |
|  Miranda   |  Mcmahon  | 41564.15 |
|   Carla    |   Melton  | 41986.90 |
|   Jason    |  Harding  | 54100.54 |
|  Margaret  |   Barry   | 58500.34 |
|   Robert   |    Duke   | 49302.91 |
+------------+-----------+----------+
Truncated to displaylimit of 10.

2. Find employee whose email addresses end with gmail.com - Use LIKE Operators

In [23]:
%%sql

SELECT first_name, last_name, salary FROM ex_employee
WHERE email LIKE '%gmail.com';

Running query in 'postgresql://admin:***@db:5432/company'

173 rows affected.

+------------+-----------+----------+
| first_name | last_name |  salary  |
+------------+-----------+----------+
|   Joshua   |   Ramos   | 65313.80 |
|   Louis    |   Rivera  | 30448.72 |
|   Tammy    |  Collins  | 39382.83 |
|   Jason    |  Harding  | 54100.54 |
|   Carrie   |   Olson   | 72155.31 |
|  Kristina  |   Banks   | 91453.39 |
|  Jessica   |   Stokes  | 60328.03 |
|  Michelle  |   Perez   | 44352.52 |
|   Susan    |   Parker  | 77946.72 |
|   Sheri    |   Clark   | 63724.89 |
+------------+-----------+----------+
Truncated to displaylimit of 10.

In [26]:
%%sql
SELECT first_name, salary FROM ex_employee
WHERE first_name LIKE 'J%' ORDER BY salary ASC;

Running query in 'postgresql://admin:***@db:5432/company'

155 rows affected.

+------------+----------+
| first_name |  salary  |
+------------+----------+
|   Jacob    | 30214.96 |
|    John    | 30228.70 |
|   James    | 31054.69 |
| Jacqueline | 31534.88 |
|   Jaime    | 31594.03 |
|    John    | 32104.25 |
|   Jeremy   | 32632.10 |
|  Jennifer  | 33955.54 |
|  Jeffrey   | 34103.02 |
|  Jeremiah  | 34163.36 |
+------------+----------+
Truncated to displaylimit of 10.

3. Retrieve employees who belong to either the 'Finance' or 'Marketing' departments -- Use IN Operator

In [29]:
%%sql
SELECT first_name, last_name, department FROM ex_employee
WHERE department IN ('Finance', 'Marketing');

-- SELECT first_name, last_name, department FROM ex_employee
-- WHERE department = 'Finance' OR department = 'Marketing';

Running query in 'postgresql://admin:***@db:5432/company'

398 rows affected.

+------------+-----------+------------+
| first_name | last_name | department |
+------------+-----------+------------+
|   Louis    |   Rivera  |  Finance   |
|  Sabrina   |  Gonzalez | Marketing  |
|  Jillian   |   Lewis   | Marketing  |
|  Caroline  |  Kennedy  |  Finance   |
|    Sara    |   Miller  | Marketing  |
|   Victor   |    Lamb   |  Finance   |
|   Carla    |   Melton  |  Finance   |
|   Robert   |  Sullivan |  Finance   |
|   Jason    |  Harding  |  Finance   |
|   Karen    |   Brown   | Marketing  |
+------------+-----------+------------+
Truncated to displaylimit of 10.

#### Other Operators

1. Find employees where the email column is NULL (if applicable)

In [32]:
%%sql
SELECT first_name, last_name, email FROM ex_employee
WHERE email IS NULL;

Running query in 'postgresql://admin:***@db:5432/company'

+------------+-----------+-------+
| first_name | last_name | email |
+------------+-----------+-------+
+------------+-----------+-------+

2. List employees sorted by salary in DESCENDING order.

In [37]:
%%sql
SELECT first_name, last_name, salary FROM ex_employee
ORDER BY salary DESC;

-- SELECT first_name, last_name, salary FROM ex_employee
-- ORDER BY salary ASC;
-- OR
-- ORDER BY salary;

Running query in 'postgresql://admin:***@db:5432/company'

1000 rows affected.

+------------+-----------+----------+
| first_name | last_name |  salary  |
+------------+-----------+----------+
|   Corey    |   Barton  | 99969.69 |
|   Joseph   |   Ibarra  | 99953.40 |
|   Teresa   |    Lee    | 99901.22 |
|  Kimberly  |  Williams | 99774.95 |
|  Kristina  |  Martinez | 99644.45 |
|  Melissa   |  Townsend | 99618.31 |
|  Michael   |  Mcdaniel | 99530.75 |
|   Faith    |   Green   | 99494.27 |
|   Betty    |  Griffin  | 99398.29 |
|   Kelly    |  Mendoza  | 99277.04 |
+------------+-----------+----------+
Truncated to displaylimit of 10.

3. Retrieve the top 5 highest-paid employees.

In [38]:
%%sql
SELECT first_name, last_name, salary FROM ex_employee
LIMIT 4;

Running query in 'postgresql://admin:***@db:5432/company'

4 rows affected.

+------------+-----------+----------+
| first_name | last_name |  salary  |
+------------+-----------+----------+
|  Vanessa   |  Jackson  | 69330.56 |
|   Penny    |   Ingram  | 96482.00 |
|  Matthew   |  Mcdonald | 97416.22 |
|   Joshua   |   Ramos   | 65313.80 |
+------------+-----------+----------+

In [40]:
%%sql
SELECT first_name, last_name, salary FROM ex_employee
ORDER BY salary DESC
LIMIT 5;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+-----------+----------+
| first_name | last_name |  salary  |
+------------+-----------+----------+
|   Corey    |   Barton  | 99969.69 |
|   Joseph   |   Ibarra  | 99953.40 |
|   Teresa   |    Lee    | 99901.22 |
|  Kimberly  |  Williams | 99774.95 |
|  Kristina  |  Martinez | 99644.45 |
+------------+-----------+----------+

4. Retrieve a list of unique departments

In [41]:
%%sql
SELECT DISTINCT department
FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+
| department |
+------------+
|  Finance   |
| Operations |
|     HR     |
|     IT     |
| Marketing  |
+------------+

In [42]:
%%sql
SELECT COUNT(DISTINCT department) as DEPARTMENT_UNIQUE_COUNT
FROM ex_employee;

Running query in 'postgresql://admin:***@db:5432/company'

1 rows affected.

+-------------------------+
| department_unique_count |
+-------------------------+
|            5            |
+-------------------------+

#### Set Operators

| Operator  | Description                          |
|-----------|--------------------------------------|
| UNION     | Combines results, removes duplicates |
| UNION ALL | Combines results, keeps duplicates   |
| INTERSECT | Returns common results               |
| EXCEPT    | Returns results in first, not second |

In [43]:
%%sql
DROP TABLE IF EXISTS students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [48]:
%%sql
CREATE TABLE students_2026 (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(100),
    course VARCHAR(50)
);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [49]:
%%sql
INSERT INTO students_2026 (student_id, student_name, course) VALUES
(1, 'Aarav Sharma', 'Computer Science'),
(2, 'Ishita Verma', 'Machanical Engineering'),
(3, 'Kabir Patel', 'Electronics'),
(4, 'Ananya Desai', 'Civil Engineering'),
(5, 'Rahul Gupta', 'Computer Science');

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

++
||
++
++

In [50]:
%%sql
SELECT * FROM students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+--------------+------------------------+
| student_id | student_name |         course         |
+------------+--------------+------------------------+
|     1      | Aarav Sharma |    Computer Science    |
|     2      | Ishita Verma | Machanical Engineering |
|     3      | Kabir Patel  |      Electronics       |
|     4      | Ananya Desai |   Civil Engineering    |
|     5      | Rahul Gupta  |    Computer Science    |
+------------+--------------+------------------------+

In [51]:
%%sql
DROP TABLE IF EXISTS students_2025;

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [52]:
%%sql
CREATE TABLE students_2025 (
    student_id INT PRIMARY KEY,
    student_name VARCHAR(100),
    course VARCHAR(50)
);

Running query in 'postgresql://admin:***@db:5432/company'

++
||
++
++

In [53]:
%%sql
INSERT INTO students_2025 (student_id, student_name, course) VALUES
(3, 'Kabir Patel', 'Electronics'), -- same as students_2026
(4, 'Ananya Desai', 'Civil Engineering'), -- same as students_2026
(6, 'Meera Rao', 'Computer Science'),
(7, 'Vikram Singh', 'Mathematics'),
(8, 'Sanaya Kapoor', 'Physics');

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

++
||
++
++

In [54]:
%%sql
SELECT * FROM students_2025;

Running query in 'postgresql://admin:***@db:5432/company'

5 rows affected.

+------------+---------------+-------------------+
| student_id |  student_name |       course      |
+------------+---------------+-------------------+
|     3      |  Kabir Patel  |    Electronics    |
|     4      |  Ananya Desai | Civil Engineering |
|     6      |   Meera Rao   |  Computer Science |
|     7      |  Vikram Singh |    Mathematics    |
|     8      | Sanaya Kapoor |      Physics      |
+------------+---------------+-------------------+

 **-- UNION --** Combines results, removes duplicates

In [57]:
%%sql
SELECT * FROM students_2025
UNION
SELECT * FROM students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

8 rows affected.

+------------+---------------+------------------------+
| student_id |  student_name |         course         |
+------------+---------------+------------------------+
|     7      |  Vikram Singh |      Mathematics       |
|     4      |  Ananya Desai |   Civil Engineering    |
|     8      | Sanaya Kapoor |        Physics         |
|     2      |  Ishita Verma | Machanical Engineering |
|     5      |  Rahul Gupta  |    Computer Science    |
|     3      |  Kabir Patel  |      Electronics       |
|     6      |   Meera Rao   |    Computer Science    |
|     1      |  Aarav Sharma |    Computer Science    |
+------------+---------------+------------------------+

**-- UNION ALL --** - Combines results, keeps duplicates

In [58]:
%%sql
SELECT * FROM students_2025
UNION ALL
SELECT * FROM students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

10 rows affected.

+------------+---------------+------------------------+
| student_id |  student_name |         course         |
+------------+---------------+------------------------+
|     3      |  Kabir Patel  |      Electronics       |
|     4      |  Ananya Desai |   Civil Engineering    |
|     6      |   Meera Rao   |    Computer Science    |
|     7      |  Vikram Singh |      Mathematics       |
|     8      | Sanaya Kapoor |        Physics         |
|     1      |  Aarav Sharma |    Computer Science    |
|     2      |  Ishita Verma | Machanical Engineering |
|     3      |  Kabir Patel  |      Electronics       |
|     4      |  Ananya Desai |   Civil Engineering    |
|     5      |  Rahul Gupta  |    Computer Science    |
+------------+---------------+------------------------+
Truncated to displaylimit of 10.

**-- INTERSECT --** - Returns common results in both tables

In [59]:
%%sql
SELECT * FROM students_2025
INTERSECT
SELECT * FROM students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

2 rows affected.

+------------+--------------+-------------------+
| student_id | student_name |       course      |
+------------+--------------+-------------------+
|     4      | Ananya Desai | Civil Engineering |
|     3      | Kabir Patel  |    Electronics    |
+------------+--------------+-------------------+

**-- EXCEPT --** - Returns results in the first table but not in the second

In [60]:
%%sql
SELECT * FROM students_2025
EXCEPT
SELECT * FROM students_2026;

Running query in 'postgresql://admin:***@db:5432/company'

3 rows affected.

+------------+---------------+------------------+
| student_id |  student_name |      course      |
+------------+---------------+------------------+
|     7      |  Vikram Singh |   Mathematics    |
|     8      | Sanaya Kapoor |     Physics      |
|     6      |   Meera Rao   | Computer Science |
+------------+---------------+------------------+